---
kind: method
id: M:Autodesk.Revit.DB.TemporaryViewModes.IsModeActive(Autodesk.Revit.DB.TemporaryViewMode)
source: html/e65c3c3b-2c32-b680-03dd-17ee2318da41.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.IsModeActive Method

Tests whether a given mode is currently active or not.

## Syntax (C#)
```csharp
public bool IsModeActive(
	TemporaryViewMode mode
)
```

## Parameters
- **mode** (`Autodesk.Revit.DB.TemporaryViewMode`) - The mode being tested

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration